{
  "source": "stackoverflow_expert",
  "url": "https://stackoverflow.com/questions/19444431",
  "type": "expert_qa",
  "content": "Q: What is difference between MVC, MVP &amp; MVVM design pattern in terms of coding c#\n\nA: <p>If we search Google using the phrase &quot;differences between MVC, MVP &amp; MVVM design pattern&quot; then we may get a few URL's which discuss <a href=\"https://forums.asp.net/t/1944181.aspx?What%20is%20difference%20between%20MVC%20MVP%20MVVM%20design%20pattern\" rel=\"noreferrer\">the difference between MVC MVP &amp; MVVM design pattern theoretically like</a>:</p>\n<p><strong>MVP</strong></p>\n<p>Use in situations where binding via a &quot;dataContext&quot; is not possible.\nWindows Forms is a perfect example of this.  In order to separate the view from the model, a presenter is needed.  Since the view cannot directly bind to the presenter, information must be passed to the view via an interface (IView).</p>\n<p><strong>MVVM</strong></p>\n<p>Use in situations where binding via a &quot;dataContext&quot; is possible.  Why?  The various IView interfaces for each view are removed which means less code to maintain.\nSome examples where MVVM is possible to include WPF and javascript projects using Knockout.</p>\n<p><strong>MVC</strong></p>\n<p>Use in situations where the connection between the view and the rest of the program is not always available (and you can’t effectively employ MVVM or MVP).\nThis clearly describes the situation where a web API is separated from the data sent to the client browsers.  Microsoft’s ASP.NET MVC is a great tool for managing such situations and provides a very clear MVC framework</p>\n<hr />\n<p>But I have not found a single article which discusses the difference theoretically along with sample code.</p>\n<p>It would be really nice if I get an article that discusses the difference between these 3 design patterns (MVC, MVP &amp; MVVM) along with code.</p>\n<p>I'd like to get my hands on the source code of 3 similar <strong>CRUD</strong> apps that have been implemented by these three design patterns (MVC, MVP &amp; MVVM). So that I can go through the code and understand how one should write code for these three design pattern (MVC, MVP &amp; MVVM).</p>\n<p>So if any such article exists which discusses how code would look different for these 3 design patterns (MVC, MVP &amp; MVVM) then please redirect me to that article.</p>\n",
  "score": 245,
  "timestamp": "2025-06-27T00:14:15.547385",
  "category": "expert_solutions"
}